Revit 2026 API

# LoadClassificationType Enumeration

---

An enumerated type listing all the possible load classification types for a connector object.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LoadClassificationType
```
```vb
Public Enumeration LoadClassificationType
```
```cpp
public enum class LoadClassificationType
```
```fsharp
type LoadClassificationType
```

| Member name | Value | Description |
| --- | --- | --- |
| HVAC | 3 | Load Classification Type is HVAC. |
| Lighting | 2 | Load Classification Type is Lighting. |
| Other | 0 | Load Classification Type is Other. |
| Power | 1 | Load Classification Type is Power. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace